app/services/services/create.rb

INSERT INTO "services" ("user_id", "category_id", "name", "description", "duration", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def call
      service = Service.new(payload)
      if service.save