app/services/services/find_service.rb

SELECT  "services".* FROM "services" WHERE "services"."user_id" = $1 AND "services"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
---
    def call
      Service.find_by(user_id: user_id, id: id)