app/services/client_appointments/create_for_guest.rb

    def call
      appointment = ClientAppointment.new(payload)
      if appointment.save
---
INSERT INTO "client_appointments" ("service_id", "client_name", "client_phone_number", "client_email", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"