app/services/client_appointments/find_appointment.rb

    def call
      service_ids = Service.where(user_id: user_id).map { |n| n.id }
      ClientAppointment.find_by(service_id: service_ids, id: id)
---
SELECT "services".* FROM "services" WHERE "services"."user_id" = ?  [["user_id", 3]]
SELECT  "client_appointments".* FROM "client_appointments" WHERE "client_appointments"."service_id" IN (?, ?, ?) AND "client_appointments"."id" = ? LIMIT ?  [["service_id", 2], ["service_id", 3], ["service_id", 4], ["id", 7], ["LIMIT", 1]]