app/services/client_appointments/search.rb

    def call
      @service_ids = Service.where(user_id: user_id).map { |n| n.id }
---
SELECT "services".* FROM "services" WHERE "services"."user_id" = ?  [["user_id", 3]]