app/controllers/api/v1/posts_controller.rb

INSERT INTO "api_v1_posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Lorem"], ["content", "Lorem ipsum dolor"], ["created_at", "2022-07-14 14:31:05.173063"], ["updated_at", "2022-07-14 14:31:05.173063"]]
---
      def create
        @api_v1_post = Api::V1::Post.new(api_v1_post_params)

        if @api_v1_post.save