app/controllers/categories_controller.rb

  def index
  # GET /categories?page=:page
    @categories = Category.order(:name).page(params[:page])
---
SELECT  "categories".* FROM "categories" ORDER BY "categories"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"