app/controllers/client_appointments_controller.rb

  def index_pending
    service_ids = Service.where(user_id: current_user.id).map{|n| n.id}
    appointments = ClientAppointment.where(service_id: service_ids, status: 'pending').page(params[:page])
---
SELECT "services".* FROM "services" WHERE "services"."user_id" = ?  [["user_id", 3]]
SELECT  "client_appointments".* FROM "client_appointments" WHERE "client_appointments"."service_id" IN (?, ?, ?) AND "client_appointments"."status" = ? LIMIT ? OFFSET ?  [["service_id", 2], ["service_id", 3], ["service_id", 4], ["status", "pending"], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "client_appointments" WHERE "client_appointments"."service_id" IN (?, ?, ?) AND "client_appointments"."status" = ?  [["service_id", 2], ["service_id", 3], ["service_id", 4], ["status", "pending"]]

  def show
    service_ids = Service.where(user_id: current_user.id).map{|n| n.id}
    appointment = ClientAppointment.find_by(service_id: service_ids, id: params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."user_id" = ?  [["user_id", 3]]
SELECT  "client_appointments".* FROM "client_appointments" WHERE "client_appointments"."service_id" IN (?, ?, ?) AND "client_appointments"."id" = ? LIMIT ?  [["service_id", 2], ["service_id", 3], ["service_id", 4], ["id", 2], ["LIMIT", 1]]

  def set_appointment
    @appointment = ClientAppointment.find_by(id: params[:id])
---
SELECT  "client_appointments".* FROM "client_appointments" WHERE "client_appointments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]