app/controllers/services_controller.rb

    def index
      @services = Service.where(user_id: current_user.id).page params[:page]
---
SELECT  "services".* FROM "services" WHERE "services"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "services" WHERE "services"."user_id" = ?  [["user_id", 3]]

    def create
      @service = Service.new(service_create_params)
      if @service.save
---
INSERT INTO "services" ("user_id", "category_id", "name", "descriprion", "duration", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
      if @service.update(service_update_params)
---
UPDATE "services" SET "category_id" = ?, "duration" = ?, "name" = ?, "price" = ?, "updated_at" = ? WHERE "services"."id" = ?  [["category_id", 7], ["duration", 253], ["name", "tesswst"], ["price", 1235647], ["updated_at", "2022-07-25 15:48:39.237084"], ["id", 1]]

    def destroy
      @service.destroy
---
DELETE FROM "services" WHERE "services"."id" = ?  [["id", 1]]

    def set_service
      @service = Service.find_by(id: params[:id], user_id: current_user.id)
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ? AND "services"."user_id" = ? LIMIT ?  [["id", 3], ["user_id", 3], ["LIMIT", 1]]