app/controllers/specialist_services_controller.rb

    def index
      @specialist_services = SpecialistService.where(user_id: current_user.id)
---
SELECT "specialist_services".* FROM "specialist_services" WHERE "specialist_services"."user_id" = ?  [["user_id", 3]]

    def create
      @specialist_service = SpecialistService.new(specialist_service_create_params)
      if @specialist_service.save
---
INSERT INTO "specialist_services" ("user_id", "service_id", "duration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["service_id", 1], ["duration", 23], ["created_at", "2022-07-22 14:17:05.364132"], ["updated_at", "2022-07-22 14:17:05.364132"]]

    def set_specialist_service
      @specialist_service = SpecialistService.find_by(id: params[:id], user_id: current_user.id)
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "specialist_services".* FROM "specialist_services" WHERE "specialist_services"."id" = ? AND "specialist_services"."user_id" = ? LIMIT ?  [["id", 1], ["user_id", 3], ["LIMIT", 1]]