app/controllers/users_controller.rb

  def update_password
    @user = current_user
    if @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$12$WE.MtczpFntnWGwWU/AGK.QVDiFwEyRcKe/NIHXLNTy7KgbtWQgeK"], ["updated_at", "2022-09-03 16:19:06.844297"], ["id", 2]]